[French]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Veuillez connecter le dongle USB 2,4 GHz de l'appareil au port USB de votre ordinateur pour l'appairage.
Please follow the steps below for pairing. = Veuillez suivre les étapes ci-dessous pour effectuer l'appairage.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Réglez l'interrupteur de connexion sur le mode RF 2,4 GHz.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Appuyez sur le bouton gauche, le bouton droit et le bouton DPI pendant 3 secondes.
3. Click the "Pair" button on the interface. = 3. Cliquez sur le bouton "Appairer" de l'interface.	
1. Connect the device to your computer with the USB cable. = 1. Connectez l'appareil à votre ordinateur grâce au câble USB.
2. Click the "Pair" button on the interface. = 2. Cliquez sur le bouton "Appairer" de l'interface.

Pair = Appairer
Close = Fermer
Pairing = Appairage en cours
Pairing completed = Appairage effectué
Pairing failed = Échec de l'appairage

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Connectez l'appareil à votre ordinateur avec un câble USB et réglez le sélecteur de connexion sur le mode RF 2,4 GHz.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Appuyez sur le bouton de fonction pendant 15 secondes, jusqu'à ce que vous entendiez des indications sonores.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Veuillez débrancher et réinsérer le récepteur sans fil 2,4 GHz. Éteignez l'appareil, puis basculez-le en mode RF 2,4 GHz.